---
kind: property
id: P:Autodesk.Revit.DB.Structure.BoundaryConditions.HostElementId
source: html/9e930666-e2e2-dcff-d441-b85daac15e00.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditions.HostElementId Property

The host element Id for the boundary conditions.

## Syntax (C#)
```csharp
public ElementId HostElementId { get; }
```